TagTool [1.5.8059.22579]

Please report any bugs and/or feature requests:
Hola Amigos

Enter "help" to list available commands. Enter "exit" to quit.

tags> 

tags> 

tags> edittag 0x12c5
Tag ui\chud\bitmaps\cortana_channel.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\bitmaps\cortana_channel.bitmap> importbitmap 0 DDS\Spartan_laser.dds
Importing image data...
Done!

tags\ui\chud\bitmaps\cortana_channel.bitmap> savetagchanges
Done!

tags\ui\chud\bitmaps\cortana_channel.bitmap> exit

tags> 

tags> edittag 0x21D4
Tag ui\chud\bitmaps\hud_vehicle_reticles.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\bitmaps\hud_vehicle_reticles.bitmap> importbitmap 0 DDS\RETICLES\DEFAULT_(MEDIUM_16;9)\Vehiclesh3.dds
Importing image data...
Done!

tags\ui\chud\bitmaps\hud_vehicle_reticles.bitmap> savetagchanges
Done!

tags\ui\chud\bitmaps\hud_vehicle_reticles.bitmap> exit

tags> 

tags> edittag 0x00005A90
Tag ui\chud\bitmaps\hud_reticles_h3.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\bitmaps\hud_reticles_h3.bitmap> importbitmap 0 DDS\RETICLES\DEFAULT_(MEDIUM_16;9)\hudh3.dds
Importing image data...
Done!

tags\ui\chud\bitmaps\hud_reticles_h3.bitmap> Setfield Sequences[10].Sprites[0].Bottom 0.190211
Bottom: Single = 0.190211 

tags\ui\chud\bitmaps\hud_reticles_h3.bitmap> Setfield Sequences[14].Sprites[0].Left 0.890605
Left: Single = 0.890605 

tags\ui\chud\bitmaps\hud_reticles_h3.bitmap> savetagchanges
Done!

tags\ui\chud\bitmaps\hud_reticles_h3.bitmap> exit

tags> 

tags> edittag 0x00002515
Tag 0x2515.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x2515.bitmap> importbitmap 0 DDS\stolen5.dds
Importing image data...
Done!

tags\0x2515.bitmap> savetagchanges
Done!

tags\0x2515.bitmap> exit

tags> 

tags> edittag 0x00002516
Tag 0x2516.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x2516.bitmap> importbitmap 0 DDS\stolen6.dds
Importing image data...
Done!

tags\0x2516.bitmap> savetagchanges
Done!

tags\0x2516.bitmap> exit

tags> 

tags> edittag 0x00002517
Tag 0x2517.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x2517.bitmap> importbitmap 0 DDS\stolen7.dds
Importing image data...
Done!

tags\0x2517.bitmap> savetagchanges
Done!

tags\0x2517.bitmap> exit

tags> 

tags> edittag 0x249D
Tag 0x249D.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x249D.bitmap> importbitmap 0 DDS\FIX\FIX1.dds
Importing image data...
Done!

tags\0x249D.bitmap> savetagchanges
Done!

tags\0x249D.bitmap> exit

tags> 

tags> edittag 0x2494
Tag 0x2494.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x2494.bitmap> importbitmap 0 DDS\FIX\FIX2.dds
Importing image data...
Done!

tags\0x2494.bitmap> savetagchanges
Done!

tags\0x2494.bitmap> exit

tags> 

tags> 

tags> edittag 0x250C
Tag ui\chud\bitmaps\scopes\spartan_laser_scope_overheat.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\bitmaps\scopes\spartan_laser_scope_overheat.bitmap> importbitmap 0 DDS\FIX\FIX3.dds
Importing image data...
Done!

tags\ui\chud\bitmaps\scopes\spartan_laser_scope_overheat.bitmap> savetagchanges
Done!

tags\ui\chud\bitmaps\scopes\spartan_laser_scope_overheat.bitmap> exit

tags> 

tags> 

tags> ECHO FUEL ROD SCOPE ( DELETE THIS IF YOU DONT LIKE TEH SCALING OF THE SCOPE)
FUEL ROD SCOPE ( DELETE THIS IF YOU DONT LIKE TEH SCALING OF THE SCOPE) 
tags> edittag 0x000021DE
Tag ui\chud\fuel_rod_cannon.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 5.7 4.5
Scale: RealPoint2d = { X: 5.7, Y: 4.5 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 2.85 2.25
Scale: RealPoint2d = { X: 2.85, Y: 2.25 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].PlacementData[0].Origin 1 0
Origin: RealPoint2d = { X: 1, Y: 0 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].PlacementData[0].Offset -315 0
Offset: RealPoint2d = { X: -315, Y: 0 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].PlacementData[0].Scale 1.65 1.65
Scale: RealPoint2d = { X: 1.65, Y: 1.65 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> savetagchanges
Done!

tags\ui\chud\fuel_rod_cannon.chud_definition> exitto tags

tags> 

tags> 

tags> 

tags> ECHO BEAM RIFFLE SCOPE ( DELETE THIS IF YOU DONT LIKE THE SCALING OF THE SCOPE)
BEAM RIFFLE SCOPE ( DELETE THIS IF YOU DONT LIKE THE SCALING OF THE SCOPE) 
tags> edittag 0x00002459
Tag ui\chud\beam_rifle.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Origin 2.21 1.05
Origin: RealPoint2d = { X: 2.21, Y: 1.05 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Offset -63 0
Offset: RealPoint2d = { X: -63, Y: 0 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Scale -3.8 3.5
Scale: RealPoint2d = { X: -3.8, Y: 3.5 } 

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Origin 2.21 1.05
Origin: RealPoint2d = { X: 2.21, Y: 1.05 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Offset -2.25 0
Offset: RealPoint2d = { X: -2.25, Y: 0 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Scale 3.5 3.5
Scale: RealPoint2d = { X: 3.5, Y: 3.5 } 

tags\ui\chud\beam_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Offset 0 1
Offset: RealPoint2d = { X: 0, Y: 1 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 3.55 3.55
Scale: RealPoint2d = { X: 3.55, Y: 3.55 } 

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 1.77 1.77
Scale: RealPoint2d = { X: 1.77, Y: 1.77 } 

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].origin 0 0.2
Origin: RealPoint2d = { X: 0, Y: 0.2 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Offset 649 0
Offset: RealPoint2d = { X: 649, Y: 0 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Scale 0.85 0.85
Scale: RealPoint2d = { X: 0.85, Y: 0.85 } 

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[1].PlacementData[0].origin 7 1
Origin: RealPoint2d = { X: 7, Y: 1 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[1].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[1].PlacementData[0].Scale 0.85 0.85
Scale: RealPoint2d = { X: 0.85, Y: 0.85 } 

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[2].PlacementData[0].origin 0 -0.2
Origin: RealPoint2d = { X: 0, Y: -0.2 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[2].PlacementData[0].Offset -649 0
Offset: RealPoint2d = { X: -649, Y: 0 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[2].PlacementData[0].Scale 0.85 0.85
Scale: RealPoint2d = { X: 0.85, Y: 0.85 } 

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[3].PlacementData[0].origin 7 1
Origin: RealPoint2d = { X: 7, Y: 1 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[3].PlacementData[0].Offset 1 0
Offset: RealPoint2d = { X: 1, Y: 0 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[3].PlacementData[0].Scale 1.7 1.7
Scale: RealPoint2d = { X: 1.7, Y: 1.7 } 

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[4].PlacementData[0].origin 7 1
Origin: RealPoint2d = { X: 7, Y: 1 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[4].PlacementData[0].Offset -1 0
Offset: RealPoint2d = { X: -1, Y: 0 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[4].PlacementData[0].Scale -1.7 1.7
Scale: RealPoint2d = { X: -1.7, Y: 1.7 } 

tags\ui\chud\beam_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[7].BitmapWidgets[0].PlacementData[0].origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[7].BitmapWidgets[0].PlacementData[0].Scale 2.55 2.55
Scale: RealPoint2d = { X: 2.55, Y: 2.55 } 

tags\ui\chud\beam_rifle.chud_definition> 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[7].BitmapWidgets[0].PlacementData[0].origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[7].BitmapWidgets[0].PlacementData[0].Scale 1.275 1.275
Scale: RealPoint2d = { X: 1.275, Y: 1.275 } 

tags\ui\chud\beam_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\beam_rifle.chud_definition> exitto tags

tags> 

tags> edittag 0x00002499
Tag 0x2499.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x2499.bitmap> importbitmap 0 DDS\TEST\TEST1.dds
Importing image data...
Done!

tags\0x2499.bitmap> savetagchanges
Done!

tags\0x2499.bitmap> exit

tags> 

tags> edittag 0x0000249A
Tag 0x249A.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x249A.bitmap> importbitmap 0 DDS\TEST\TEST2.dds
Importing image data...
Done!

tags\0x249A.bitmap> savetagchanges
Done!

tags\0x249A.bitmap> exit

tags> 

tags> edittag 0x0000249C
Tag 0x249C.bitmap has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x249C.bitmap> importbitmap 0 DDS\TEST\TEST3.dds
Importing image data...
Done!

tags\0x249C.bitmap> savetagchanges
Done!

tags\0x249C.bitmap> exit

tags> 

tags> 

tags> 

tags> 

tags> 

tags> Edittag 0x250E
Tag 0x250E.chud_animation_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x250E.chud_animation_definition> removeblockelements Alpha 0 *
Successfully removed 1 element from Alpha at index 0: List`1<ScalarBlock>
null

tags\0x250E.chud_animation_definition> editblock Rotation[0]

tags\0x250E.chud_animation_definition\Rotation[0]> editblock Keyframes[1]

tags\0x250E.chud_animation_definition\Rotation[0]\Keyframes[1]> setfield Framenumber 180
FrameNumber: Int32 = 180 

tags\0x250E.chud_animation_definition\Rotation[0]\Keyframes[1]> savetagchanges
Done!

tags\0x250E.chud_animation_definition\Rotation[0]\Keyframes[1]> exit

tags\0x250E.chud_animation_definition\Rotation[0]> editblock Function 

tags\0x250E.chud_animation_definition\Rotation[0]\Function> setfield data 08340000000000000000803F000000000000000000000000000000001C00000001000000070000CDFFFF7F7F8017033FC08B01C0E0C5204000000000
Data: Byte[] = {...}[60] 

tags\0x250E.chud_animation_definition\Rotation[0]\Function> savetagchanges
Done!

tags\0x250E.chud_animation_definition\Rotation[0]\Function> exitto tags

tags> 

tags> edittag 0x250D
Tag 0x250D.chud_animation_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x250D.chud_animation_definition> editblock Rotation[0]

tags\0x250D.chud_animation_definition\Rotation[0]> editblock Function 

tags\0x250D.chud_animation_definition\Rotation[0]\Function> setfield Data 08340000000000000000803F000000000000000000000000000000001400000001000000040000CDFFFF7F7F0000803F00000000
Data: Byte[] = {...}[52] 

tags\0x250D.chud_animation_definition\Rotation[0]\Function> savetagchanges
Done!

tags\0x250D.chud_animation_definition\Rotation[0]\Function> exit

tags\0x250D.chud_animation_definition\Rotation[0]> 

tags\0x250D.chud_animation_definition\Rotation[0]> editblock Keyframes[1]

tags\0x250D.chud_animation_definition\Rotation[0]\Keyframes[1]> Setfield Framenumber 1000
FrameNumber: Int32 = 1000 

tags\0x250D.chud_animation_definition\Rotation[0]\Keyframes[1]> Setfield Angles -180 0 0
Angles: RealEulerAngles3d = { Yaw: { Degrees: -180, Radians: -3.141593 }, Pitch: { Degrees: 0, Radians: 0 }, Roll: { Degrees: 0, Radians: 0 } } 

tags\0x250D.chud_animation_definition\Rotation[0]\Keyframes[1]> savetagchanges
Done!

tags\0x250D.chud_animation_definition\Rotation[0]\Keyframes[1]> exitto tags

tags> 

tags> edittag 0x2514
Tag 0x2514.chud_animation_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x2514.chud_animation_definition> editblock Rotation[0]

tags\0x2514.chud_animation_definition\Rotation[0]> editblock Keyframes[1]

tags\0x2514.chud_animation_definition\Rotation[0]\Keyframes[1]> setfield Angles -270 0 0
Angles: RealEulerAngles3d = { Yaw: { Degrees: -270, Radians: -4.712389 }, Pitch: { Degrees: 0, Radians: 0 }, Roll: { Degrees: 0, Radians: 0 } } 

tags\0x2514.chud_animation_definition\Rotation[0]\Keyframes[1]> savetagchanges
Done!

tags\0x2514.chud_animation_definition\Rotation[0]\Keyframes[1]> exitto tags

tags> 

tags> edittag 0x2512
Tag 0x2512.chud_animation_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\0x2512.chud_animation_definition> setfield Alpha[0].Keyframes[1].Timeoffset 180
TimeOffset: Int32 = 180 

tags\0x2512.chud_animation_definition> setfield Alpha[0].Keyframes[1].scalarvalue 0.2 
ScalarValue: Single = 0.2 

tags\0x2512.chud_animation_definition> savetagchanges
Done!

tags\0x2512.chud_animation_definition> Addblockelements Scale
Successfully added 1 element to Scale: List`1<ScaleBlock>
{...}[1]

tags\0x2512.chud_animation_definition> editblock Scale[0]

tags\0x2512.chud_animation_definition\Scale[0]> editblock Function

tags\0x2512.chud_animation_definition\Scale[0]\Function> setfield data 08340000000000000000803F000000000000000000000000000000001400000001000000040000CDFFFF7F7F0000803F00000000
Data: Byte[] = {...}[52] 

tags\0x2512.chud_animation_definition\Scale[0]\Function> savetagchanges
Done!

tags\0x2512.chud_animation_definition\Scale[0]\Function> exit

tags\0x2512.chud_animation_definition\Scale[0]> exit

tags\0x2512.chud_animation_definition> 

tags\0x2512.chud_animation_definition>  

tags\0x2512.chud_animation_definition> Removeblockelements Scale 1 *


ERROR: An invalid argument was specified
> Invalid index specified: 1

Enter "Help RemoveBlockElements" for command syntax.

tags\0x2512.chud_animation_definition> Editblock Scale[0]

tags\0x2512.chud_animation_definition\Scale[0]> Addblockelements Keyframes
Successfully added 1 element to Keyframes: List`1<AnimationBlock>
{...}[1]

tags\0x2512.chud_animation_definition\Scale[0]> Addblockelements Keyframes
Successfully added 1 element to Keyframes: List`1<AnimationBlock>
{...}[2]

tags\0x2512.chud_animation_definition\Scale[0]> Removeblockelements Keyframes 3 *


ERROR: An invalid argument was specified
> Invalid index specified: 3

Enter "Help RemoveBlockElements" for command syntax.

tags\0x2512.chud_animation_definition\Scale[0]> Removeblockelements Keyframes 2 *


ERROR: An invalid argument was specified
> Invalid index specified: 2

Enter "Help RemoveBlockElements" for command syntax.

tags\0x2512.chud_animation_definition\Scale[0]> Editblock Keyframes[0]

tags\0x2512.chud_animation_definition\Scale[0]\Keyframes[0]> setfield scale 1 1
Scale: RealPoint2d = { X: 1, Y: 1 } 

tags\0x2512.chud_animation_definition\Scale[0]\Keyframes[0]> setfield Timeoffset 0
TimeOffset: Int32 = 0 

tags\0x2512.chud_animation_definition\Scale[0]\Keyframes[0]> savetagchanges
Done!

tags\0x2512.chud_animation_definition\Scale[0]\Keyframes[0]> Exit

tags\0x2512.chud_animation_definition\Scale[0]> Editblock Keyframes[1]

tags\0x2512.chud_animation_definition\Scale[0]\Keyframes[1]> setfield scale 0.75 0.75
Scale: RealPoint2d = { X: 0.75, Y: 0.75 } 

tags\0x2512.chud_animation_definition\Scale[0]\Keyframes[1]> setfield Timeoffset 180
TimeOffset: Int32 = 180 

tags\0x2512.chud_animation_definition\Scale[0]\Keyframes[1]> savetagchanges
Done!

tags\0x2512.chud_animation_definition\Scale[0]\Keyframes[1]> exit

tags\0x2512.chud_animation_definition\Scale[0]> exit

tags\0x2512.chud_animation_definition> 

tags\0x2512.chud_animation_definition> Addblockelements Rotation
Successfully added 1 element to Rotation: List`1<RotationBlock>
{...}[1]

tags\0x2512.chud_animation_definition> Removeblockelements Rotation 1 *


ERROR: An invalid argument was specified
> Invalid index specified: 1

Enter "Help RemoveBlockElements" for command syntax.

tags\0x2512.chud_animation_definition> Editblock Rotation[0]

tags\0x2512.chud_animation_definition\Rotation[0]> Editblock Function

tags\0x2512.chud_animation_definition\Rotation[0]\Function> Setfield data 08340000000000000000803F000000000000000000000000000000001C00000001000000070000CDFFFF7F7F8017033FC08B01C0E0C5204000000000
Data: Byte[] = {...}[60] 

tags\0x2512.chud_animation_definition\Rotation[0]\Function> savetagchanges
Done!

tags\0x2512.chud_animation_definition\Rotation[0]\Function> exit

tags\0x2512.chud_animation_definition\Rotation[0]> Addblockelements Keyframes
Successfully added 1 element to Keyframes: List`1<AnimationBlock>
{...}[1]

tags\0x2512.chud_animation_definition\Rotation[0]> Addblockelements Keyframes
Successfully added 1 element to Keyframes: List`1<AnimationBlock>
{...}[2]

tags\0x2512.chud_animation_definition\Rotation[0]> Removeblockelements Keyframes 2 *


ERROR: An invalid argument was specified
> Invalid index specified: 2

Enter "Help RemoveBlockElements" for command syntax.

tags\0x2512.chud_animation_definition\Rotation[0]> Removeblockelements Keyframes 3 *


ERROR: An invalid argument was specified
> Invalid index specified: 3

Enter "Help RemoveBlockElements" for command syntax.

tags\0x2512.chud_animation_definition\Rotation[0]> editblock Keyframes[1]

tags\0x2512.chud_animation_definition\Rotation[0]\Keyframes[1]> setfield framenumber 360
FrameNumber: Int32 = 360 

tags\0x2512.chud_animation_definition\Rotation[0]\Keyframes[1]> setfield angles -90 0 0
Angles: RealEulerAngles3d = { Yaw: { Degrees: -90, Radians: -1.570796 }, Pitch: { Degrees: 0, Radians: 0 }, Roll: { Degrees: 0, Radians: 0 } } 

tags\0x2512.chud_animation_definition\Rotation[0]\Keyframes[1]> savetagchanges
Done!

tags\0x2512.chud_animation_definition\Rotation[0]\Keyframes[1]> exitto tags

tags> 

tags> ECHO : BLOATED CMDS I KNOW :"(, not in the mood to make it setfield command as i am having stress with spartan laser, you can modify it as you wish including all of the cmds (remember if the command are public, its anyone game)
: BLOATED CMDS I KNOW :(, not in the mood to make it setfield command as i am having stress with spartan laser, you can modify it as you wish including all of the cmds (remember if the command are public, its anyone game) 
tags> 

tags> echo (Spartan Laser Tag) I stole satomi value yes I know I'm an criminal (satomi I'm sorry, talk to me on disc if you want it this mod to be removed MinelelolΓäó#2688)
(Spartan Laser Tag) I stole satomi value yes I know I'm an criminal (satomi I'm sorry, talk to me on disc if you want it this mod to be removed MinelelolΓäó 
tags> edittag 0x000024AB
Tag ui\chud\spartan_laser.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[6]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[6]> editblock AnimationData[0]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[6]\AnimationData[0]> editblock Active

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[6]\AnimationData[0]\Active> Setfield inputtype Time
InputType: ChudWidgetAnimationInputTypeEnum = Time 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[6]\AnimationData[0]\Active> Setfield flags 0
Flags: ChudWidgetAnimationFlags = 0 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[6]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[6]\AnimationData[0]\Active> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[6]\AnimationData[0]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[6]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[3]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]> editblock AnimationData[0]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]> editblock Active

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]\Active> Setfield flags 0
Flags: ChudWidgetAnimationFlags = 0 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]\Active> Setfield inputtype Time
InputType: ChudWidgetAnimationInputTypeEnum = Time 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]\Active> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[3]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]> editblock AnimationData[0]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]> editblock Active

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]\Active> Setfield flags 0
Flags: ChudWidgetAnimationFlags = 0 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]\Active> Setfield inputtype Time
InputType: ChudWidgetAnimationInputTypeEnum = Time 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]\Active> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]\AnimationData[0]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[3]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[2]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]> editblock AnimationData[0]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\AnimationData[0]> editblock Active

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\AnimationData[0]\Active> Setfield flags 0
Flags: ChudWidgetAnimationFlags = 0 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\AnimationData[0]\Active> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\AnimationData[0]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[2]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]> editblock Renderdata[0]

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield shadertype Simple
ShaderType: ChudShaderType = Simple 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield LocalScalarD 0
LocalScalarD: Single = 0 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputColorA HighlightForeground 
OutputColorA: OutputColorValue_HO = HighlightForeground 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputColorB LocalA 
OutputColorB: OutputColorValue_HO = LocalA 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputColorC LocalA 
OutputColorC: OutputColorValue_HO = LocalA 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputColorD LocalD 
OutputColorD: OutputColorValue_HO = LocalD 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputColorE LocalA 
OutputColorE: OutputColorValue_HO = LocalA 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputColorF LocalA 
OutputColorF: OutputColorValue_HO = LocalA 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputScalarA Input 
OutputScalarA: OutputScalarValue = Input 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputScalarB Input 
OutputScalarB: OutputScalarValue = Input 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputScalarC Input 
OutputScalarC: OutputScalarValue = Input 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputScalarD Input 
OutputScalarD: OutputScalarValue = Input 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputScalarE Input 
OutputScalarE: OutputScalarValue = Input 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> setfield OutputScalarF Input 
OutputScalarF: OutputScalarValue = Input 

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> savetagchanges
Done!

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]\Renderdata[0]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]\BitmapWidgets[2]> exit

tags\ui\chud\spartan_laser.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Offset -57 -52.5
Offset: RealPoint2d = { X: -57, Y: -52.5 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Offset 57 -52.5
Offset: RealPoint2d = { X: 57, Y: -52.5 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Scale -2.25 2.25
Scale: RealPoint2d = { X: -2.25, Y: 2.25 } 

tags\ui\chud\spartan_laser.chud_definition> savetagchanges
Done!

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Echo Crosshair ( for unzoomed lol )
Crosshair ( for unzoomed lol ) 
tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 11
BitmapSequenceIndex: Byte = 11 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Echo Crosshair (Zoomed)
Crosshair (Zoomed) 
tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].BitmapSequenceIndex 25
BitmapSequenceIndex: Byte = 25 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].Runtimewidgetindex 7
RuntimeWidgetIndex: Int32 = 7 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].PlacementData[0].Scale 1.77 1.77
Scale: RealPoint2d = { X: 1.77, Y: 1.77 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].PlacementData[0].Origin 0 -10
Origin: RealPoint2d = { X: 0, Y: -10 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap 0x2513
Bitmap: CachedTag = [0x2513] 0x2513.bitmap 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Name Charge_Thingy
Name: StringId = invalid 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].BitmapSequenceIndex 0
BitmapSequenceIndex: Byte = 0 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Name Useless_Shit
Name: StringId = invalid 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Name Useless_Shit2
Name: StringId = invalid 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Echo Crosshair Zoom and Unzoom animation
Crosshair Zoom and Unzoom animation 
tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap 0x12c5
Bitmap: CachedTag = [0x12C5] ui\chud\bitmaps\cortana_channel.bitmap 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].PlacementData[0].Scale 0.7125 0.7125
Scale: RealPoint2d = { X: 0.7125, Y: 0.7125 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].StateData[0].Unitzoomflags BinocularsEnabled
UnitZoomFlags: UnitZoom = BinocularsEnabled 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Name Crosshair_Unzoomed
Name: StringId = invalid 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].RenderData[0].Externalinput Zero
ExternalInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap 0x12c5
Bitmap: CachedTag = [0x12C5] ui\chud\bitmaps\cortana_channel.bitmap 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].PlacementData[0].Scale 0.75 0.75
Scale: RealPoint2d = { X: 0.75, Y: 0.75 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].RenderData[0].Rangeinput Autoaim
RangeInput: ChudRenderExternalInputHO = Autoaim 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].StateData[0].Unitzoomflags Unitiszoomedlevel1
UnitZoomFlags: UnitZoom = UnitIsZoomedLevel1 

tags\ui\chud\spartan_laser.chud_definition> savetagchanges
Done!

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Echo Scope (pain)
Scope (pain) 
tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].TextWidgets[0].PlacementData[0].Offset 0 186
Offset: RealPoint2d = { X: 0, Y: 186 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].TextWidgets[0].PlacementData[0].Scale 1.2 1.2
Scale: RealPoint2d = { X: 1.2, Y: 1.2 } 

tags\ui\chud\spartan_laser.chud_definition> Savetagchanges
Done!

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[0].PlacementData[0].Scale 1.65 1.65
Scale: RealPoint2d = { X: 1.65, Y: 1.65 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[0].RenderData[0].Externalinput Zero
ExternalInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[1].PlacementData[0].Scale 1.5 -1.5
Scale: RealPoint2d = { X: 1.5, Y: -1.5 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[1].PlacementData[0].origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[1].RenderData[0].Externalinput CameraYaw
ExternalInput: ChudRenderExternalInputHO = CameraYaw 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[1].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[1].BitmapSequenceIndex 1
BitmapSequenceIndex: Byte = 1 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[1].Bitmap 0x2513
Bitmap: CachedTag = [0x2513] 0x2513.bitmap 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].PlacementData[0].Scale 1.5 -1.5
Scale: RealPoint2d = { X: 1.5, Y: -1.5 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].PlacementData[0].Offset -18 0
Offset: RealPoint2d = { X: -18, Y: 0 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].RenderData[0].Externalinput Zero
ExternalInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].BitmapSequenceIndex 2
BitmapSequenceIndex: Byte = 2 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].Bitmap 0x2513
Bitmap: CachedTag = [0x2513] 0x2513.bitmap 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].PlacementData[0].Scale 1.5 -1.5
Scale: RealPoint2d = { X: 1.5, Y: -1.5 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].PlacementData[0].Origin 1 1
Origin: RealPoint2d = { X: 1, Y: 1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].RenderData[0].Externalinput Zero
ExternalInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].BitmapSequenceIndex 4
BitmapSequenceIndex: Byte = 4 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].Bitmap 0x2513
Bitmap: CachedTag = [0x2513] 0x2513.bitmap 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].Flags 0
Flags: WidgetBitmapFlags = None 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[4].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[4].PlacementData[0].Origin 0 -1
Origin: RealPoint2d = { X: 0, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[4].PlacementData[0].Offset 0 169.5
Offset: RealPoint2d = { X: 0, Y: 169.5 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[4].RenderData[0].Externalinput Zero
ExternalInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[4].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[4].BitmapSequenceIndex 3
BitmapSequenceIndex: Byte = 3 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[4].Bitmap 0x2513
Bitmap: CachedTag = [0x2513] 0x2513.bitmap 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[5].PlacementData[0].Scale 0.75 0.75
Scale: RealPoint2d = { X: 0.75, Y: 0.75 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[5].PlacementData[0].Origin -3 -1
Origin: RealPoint2d = { X: -3, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[5].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[5].BitmapSequenceIndex 3
BitmapSequenceIndex: Byte = 3 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[6].PlacementData[0].Scale 0.75 0.745
Scale: RealPoint2d = { X: 0.75, Y: 0.745 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[6].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[6].PlacementData[0].Offset 101 4.5
Offset: RealPoint2d = { X: 101, Y: 4.5 } 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[7].PlacementData[0].Scale 0.75 -0.745
Scale: RealPoint2d = { X: 0.75, Y: -0.745 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[7].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[7].PlacementData[0].Offset -101 4.5
Offset: RealPoint2d = { X: -101, Y: 4.5 } 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[8].PlacementData[0].Scale 0.75 0.75
Scale: RealPoint2d = { X: 0.75, Y: 0.75 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[8].PlacementData[0].Origin -3 -1
Origin: RealPoint2d = { X: -3, Y: -1 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[8].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\spartan_laser.chud_definition> 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[9].PlacementData[0].Scale -0.75 0.75
Scale: RealPoint2d = { X: -0.75, Y: 0.75 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[9].PlacementData[0].Origin -3 -0.96
Origin: RealPoint2d = { X: -3, Y: -0.96 } 

tags\ui\chud\spartan_laser.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[9].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\spartan_laser.chud_definition> Savetagchanges
Done!

tags\ui\chud\spartan_laser.chud_definition> exitto tags

tags> 

tags> 

tags> ECHO ASSAULT RIFFLE
ASSAULT RIFFLE 
tags> edittag 0x00001B8D
Tag ui\chud\assault_rifle.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\assault_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\assault_rifle.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\assault_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\assault_rifle.chud_definition> 

tags\ui\chud\assault_rifle.chud_definition> Exit

tags> Edittag 0x0000231F
Tag ui\chud\assault_rifle_v2.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\assault_rifle_v2.chud_definition> 

tags\ui\chud\assault_rifle_v2.chud_definition> editblock HUDWidgets[5]

tags\ui\chud\assault_rifle_v2.chud_definition\HUDWidgets[5]> editblock BitmapWidgets[0]

tags\ui\chud\assault_rifle_v2.chud_definition\HUDWidgets[5]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\assault_rifle_v2.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\assault_rifle_v2.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\assault_rifle_v2.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\assault_rifle_v2.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\assault_rifle_v2.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\assault_rifle_v2.chud_definition\HUDWidgets[5]\BitmapWidgets[0]> exit

tags\ui\chud\assault_rifle_v2.chud_definition\HUDWidgets[5]> exit

tags\ui\chud\assault_rifle_v2.chud_definition> 

tags\ui\chud\assault_rifle_v2.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\assault_rifle_v2.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\assault_rifle_v2.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\assault_rifle_v2.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\assault_rifle_v2.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v2.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v2.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v2.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v2.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\assault_rifle_v2.chud_definition> savetagchanges
Done!

tags\ui\chud\assault_rifle_v2.chud_definition> exit

tags> 

tags> edittag 0x00002342
Tag ui\chud\assault_rifle_v3.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\assault_rifle_v3.chud_definition> editblock HUDWidgets[5]

tags\ui\chud\assault_rifle_v3.chud_definition\HUDWidgets[5]> editblock BitmapWidgets[0]

tags\ui\chud\assault_rifle_v3.chud_definition\HUDWidgets[5]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\assault_rifle_v3.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\assault_rifle_v3.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\assault_rifle_v3.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\assault_rifle_v3.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\assault_rifle_v3.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\assault_rifle_v3.chud_definition\HUDWidgets[5]\BitmapWidgets[0]> exit

tags\ui\chud\assault_rifle_v3.chud_definition\HUDWidgets[5]> exit

tags\ui\chud\assault_rifle_v3.chud_definition> 

tags\ui\chud\assault_rifle_v3.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\assault_rifle_v3.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\assault_rifle_v3.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\assault_rifle_v3.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\assault_rifle_v3.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v3.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v3.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v3.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v3.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\assault_rifle_v3.chud_definition> savetagchanges
Done!

tags\ui\chud\assault_rifle_v3.chud_definition> exit

tags> 

tags> edittag 0x00002334
Tag ui\chud\assault_rifle_v4.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\assault_rifle_v4.chud_definition> editblock HUDWidgets[5]

tags\ui\chud\assault_rifle_v4.chud_definition\HUDWidgets[5]> editblock BitmapWidgets[0]

tags\ui\chud\assault_rifle_v4.chud_definition\HUDWidgets[5]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\assault_rifle_v4.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\assault_rifle_v4.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\assault_rifle_v4.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\assault_rifle_v4.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\assault_rifle_v4.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\assault_rifle_v4.chud_definition\HUDWidgets[5]\BitmapWidgets[0]> exit

tags\ui\chud\assault_rifle_v4.chud_definition\HUDWidgets[5]> exit

tags\ui\chud\assault_rifle_v4.chud_definition> 

tags\ui\chud\assault_rifle_v4.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\assault_rifle_v4.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\assault_rifle_v4.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\assault_rifle_v4.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\assault_rifle_v4.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v4.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v4.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v4.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v4.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\assault_rifle_v4.chud_definition> savetagchanges
Done!

tags\ui\chud\assault_rifle_v4.chud_definition> exit

tags> 

tags> edittag 0x00002353
Tag ui\chud\assault_rifle_v6.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\assault_rifle_v6.chud_definition> editblock HUDWidgets[5]

tags\ui\chud\assault_rifle_v6.chud_definition\HUDWidgets[5]> editblock BitmapWidgets[0]

tags\ui\chud\assault_rifle_v6.chud_definition\HUDWidgets[5]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\assault_rifle_v6.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\assault_rifle_v6.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\assault_rifle_v6.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\assault_rifle_v6.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\assault_rifle_v6.chud_definition\HUDWidgets[5]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\assault_rifle_v6.chud_definition\HUDWidgets[5]\BitmapWidgets[0]> exit

tags\ui\chud\assault_rifle_v6.chud_definition\HUDWidgets[5]> exit

tags\ui\chud\assault_rifle_v6.chud_definition> 

tags\ui\chud\assault_rifle_v6.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\assault_rifle_v6.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\assault_rifle_v6.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\assault_rifle_v6.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\assault_rifle_v6.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v6.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v6.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v6.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\assault_rifle_v6.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\assault_rifle_v6.chud_definition> savetagchanges
Done!

tags\ui\chud\assault_rifle_v6.chud_definition> exitto tags

tags> 

tags> 

tags> 

tags> ECHO BATTLE RIFFLE
BATTLE RIFFLE 
tags> 

tags> 

tags> edittag 0x00001D87
Tag ui\chud\battle_rifle.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\battle_rifle.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\battle_rifle.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\battle_rifle.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\battle_rifle.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\battle_rifle.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\battle_rifle.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\battle_rifle.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\battle_rifle.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\battle_rifle.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\battle_rifle.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\battle_rifle.chud_definition> 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\battle_rifle.chud_definition> 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\battle_rifle.chud_definition> 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin 1.6 0
Origin: RealPoint2d = { X: 1.6, Y: 0 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Offset 0 10.5
Offset: RealPoint2d = { X: 0, Y: 10.5 } 

tags\ui\chud\battle_rifle.chud_definition> 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 0 1.6
Origin: RealPoint2d = { X: 0, Y: 1.6 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle.chud_definition> 

tags\ui\chud\battle_rifle.chud_definition> 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\battle_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Offset -37.5 67.5
Offset: RealPoint2d = { X: -37.5, Y: 67.5 } 

tags\ui\chud\battle_rifle.chud_definition> Savetagchanges
Done!

tags\ui\chud\battle_rifle.chud_definition> exitto tags

tags> 

tags> 

tags> 

tags> edittag 0x00002361
Tag ui\chud\battle_rifle_v1.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\battle_rifle_v1.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\battle_rifle_v1.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\battle_rifle_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\battle_rifle_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\battle_rifle_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\battle_rifle_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\battle_rifle_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\battle_rifle_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\battle_rifle_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\battle_rifle_v1.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\battle_rifle_v1.chud_definition> 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v1.chud_definition> 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 1
BitmapSequenceIndex: Byte = 1 

tags\ui\chud\battle_rifle_v1.chud_definition> 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\battle_rifle_v1.chud_definition> 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin 1.6 0
Origin: RealPoint2d = { X: 1.6, Y: 0 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Offset 0 10.5
Offset: RealPoint2d = { X: 0, Y: 10.5 } 

tags\ui\chud\battle_rifle_v1.chud_definition> 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 0 1.6
Origin: RealPoint2d = { X: 0, Y: 1.6 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v1.chud_definition> 

tags\ui\chud\battle_rifle_v1.chud_definition> 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Offset -37.5 67.5
Offset: RealPoint2d = { X: -37.5, Y: 67.5 } 

tags\ui\chud\battle_rifle_v1.chud_definition> Savetagchanges
Done!

tags\ui\chud\battle_rifle_v1.chud_definition> exitto tags

tags> 

tags> edittag 0x0000236F
Tag ui\chud\battle_rifle_v2.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\battle_rifle_v2.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\battle_rifle_v2.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\battle_rifle_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\battle_rifle_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\battle_rifle_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\battle_rifle_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\battle_rifle_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\battle_rifle_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\battle_rifle_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\battle_rifle_v2.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\battle_rifle_v2.chud_definition> 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v2.chud_definition> 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\battle_rifle_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 1
BitmapSequenceIndex: Byte = 1 

tags\ui\chud\battle_rifle_v2.chud_definition> Savetagchanges
Done!

tags\ui\chud\battle_rifle_v2.chud_definition> exitto tags

tags> edittag 0x0000258B
Tag ui\chud\battle_rifle_v3.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\battle_rifle_v3.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\battle_rifle_v3.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\battle_rifle_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\battle_rifle_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\battle_rifle_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\battle_rifle_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\battle_rifle_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\battle_rifle_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\battle_rifle_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\battle_rifle_v3.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\battle_rifle_v3.chud_definition> 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v3.chud_definition> 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 1
BitmapSequenceIndex: Byte = 1 

tags\ui\chud\battle_rifle_v3.chud_definition> 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\battle_rifle_v3.chud_definition> 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin 1.6 0
Origin: RealPoint2d = { X: 1.6, Y: 0 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Offset 0 10.5
Offset: RealPoint2d = { X: 0, Y: 10.5 } 

tags\ui\chud\battle_rifle_v3.chud_definition> 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 0 1.6
Origin: RealPoint2d = { X: 0, Y: 1.6 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v3.chud_definition> 

tags\ui\chud\battle_rifle_v3.chud_definition> 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Offset -37.5 67.5
Offset: RealPoint2d = { X: -37.5, Y: 67.5 } 

tags\ui\chud\battle_rifle_v3.chud_definition> Savetagchanges
Done!

tags\ui\chud\battle_rifle_v3.chud_definition> exitto tags

tags> 

tags> edittag 0x00002581
Tag ui\chud\battle_rifle_v4.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\battle_rifle_v4.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\battle_rifle_v4.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\battle_rifle_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\battle_rifle_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\battle_rifle_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\battle_rifle_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\battle_rifle_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\battle_rifle_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\battle_rifle_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\battle_rifle_v4.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\battle_rifle_v4.chud_definition> 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v4.chud_definition> 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 1
BitmapSequenceIndex: Byte = 1 

tags\ui\chud\battle_rifle_v4.chud_definition> 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\battle_rifle_v4.chud_definition> 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin 1.6 0
Origin: RealPoint2d = { X: 1.6, Y: 0 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Offset 0 10.5
Offset: RealPoint2d = { X: 0, Y: 10.5 } 

tags\ui\chud\battle_rifle_v4.chud_definition> 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 0 1.6
Origin: RealPoint2d = { X: 0, Y: 1.6 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v4.chud_definition> 

tags\ui\chud\battle_rifle_v4.chud_definition> 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Offset -37.5 67.5
Offset: RealPoint2d = { X: -37.5, Y: 67.5 } 

tags\ui\chud\battle_rifle_v4.chud_definition> Savetagchanges
Done!

tags\ui\chud\battle_rifle_v4.chud_definition> exitto tags

tags> 

tags> edittag 0x00002595
Tag ui\chud\battle_rifle_v5.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\battle_rifle_v5.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\battle_rifle_v5.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\battle_rifle_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\battle_rifle_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\battle_rifle_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\battle_rifle_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\battle_rifle_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\battle_rifle_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\battle_rifle_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\battle_rifle_v5.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\battle_rifle_v5.chud_definition> 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v5.chud_definition> 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 1
BitmapSequenceIndex: Byte = 1 

tags\ui\chud\battle_rifle_v5.chud_definition> 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\battle_rifle_v5.chud_definition> 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin 1.6 0
Origin: RealPoint2d = { X: 1.6, Y: 0 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Offset 0 10.5
Offset: RealPoint2d = { X: 0, Y: 10.5 } 

tags\ui\chud\battle_rifle_v5.chud_definition> 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 0 1.6
Origin: RealPoint2d = { X: 0, Y: 1.6 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v5.chud_definition> 

tags\ui\chud\battle_rifle_v5.chud_definition> 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Offset -37.5 67.5
Offset: RealPoint2d = { X: -37.5, Y: 67.5 } 

tags\ui\chud\battle_rifle_v5.chud_definition> Savetagchanges
Done!

tags\ui\chud\battle_rifle_v5.chud_definition> exitto tags

tags> 

tags> edittag 0x00002381
Tag ui\chud\battle_rifle_v6.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\battle_rifle_v6.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\battle_rifle_v6.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\battle_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\battle_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\battle_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\battle_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\battle_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\battle_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\battle_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\battle_rifle_v6.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\battle_rifle_v6.chud_definition> 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\battle_rifle_v6.chud_definition> 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 1
BitmapSequenceIndex: Byte = 1 

tags\ui\chud\battle_rifle_v6.chud_definition> 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\battle_rifle_v6.chud_definition> 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin 1.6 0
Origin: RealPoint2d = { X: 1.6, Y: 0 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Offset 0 10.5
Offset: RealPoint2d = { X: 0, Y: 10.5 } 

tags\ui\chud\battle_rifle_v6.chud_definition> 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 0 1.6
Origin: RealPoint2d = { X: 0, Y: 1.6 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\battle_rifle_v6.chud_definition> 

tags\ui\chud\battle_rifle_v6.chud_definition> 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Offset -37.5 67.5
Offset: RealPoint2d = { X: -37.5, Y: 67.5 } 

tags\ui\chud\battle_rifle_v6.chud_definition> Savetagchanges
Done!

tags\ui\chud\battle_rifle_v6.chud_definition> exitto tags

tags> 

tags> Echo (Beam Riffle) not much really if you dont edit the scope that is
(Beam Riffle) not much really if you dont edit the scope that is 
tags> edittag 0x00002459
Tag ui\chud\beam_rifle.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\beam_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\beam_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\beam_rifle.chud_definition> exitto tags

tags> 

tags> Echo BRUTE SHOT (not really much LMAO)
BRUTE SHOT (not really much LMAO) 
tags> edittag 0x00001D19
Tag ui\chud\brute_shot.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\brute_shot.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\brute_shot.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\brute_shot.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].PlacementData[0].Scale 0.5625 0.5625
Scale: RealPoint2d = { X: 0.5625, Y: 0.5625 } 

tags\ui\chud\brute_shot.chud_definition> Setfield HUDWidgets[5].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\brute_shot.chud_definition> savetagchanges
Done!

tags\ui\chud\brute_shot.chud_definition> exitto tags

tags> 

tags> Echo CARBINE (DEAR GOD)
CARBINE (DEAR GOD) 
tags> Edittag 0x00001DBA
Tag ui\chud\carbine.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\carbine.chud_definition> 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine.chud_definition> 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin -1.8 1
Origin: RealPoint2d = { X: -1.8, Y: 1 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine.chud_definition> 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 1.8 -1
Origin: RealPoint2d = { X: 1.8, Y: -1 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine.chud_definition> 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin -1.8 -1
Origin: RealPoint2d = { X: -1.8, Y: -1 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine.chud_definition> 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Origin 1.8 1
Origin: RealPoint2d = { X: 1.8, Y: 1 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine.chud_definition> 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Origin 1 1
Origin: RealPoint2d = { X: 1, Y: 1 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Offset 382.5 154.5
Offset: RealPoint2d = { X: 382.5, Y: 154.5 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Scale -2.1 -2.1
Scale: RealPoint2d = { X: -2.1, Y: -2.1 } 

tags\ui\chud\carbine.chud_definition> 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Offset -468 -162
Offset: RealPoint2d = { X: -468, Y: -162 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine.chud_definition> 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Origin -3.27 0
Origin: RealPoint2d = { X: -3.27, Y: 0 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Scale 1.365 1.365
Scale: RealPoint2d = { X: 1.365, Y: 1.365 } 

tags\ui\chud\carbine.chud_definition> savetagchanges
Done!

tags\ui\chud\carbine.chud_definition> exitto tags

tags> 

tags> edittag 0x000025BA
Tag ui\chud\carbine_v1.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\carbine_v1.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\carbine_v1.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\carbine_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\carbine_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\carbine_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\carbine_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\carbine_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\carbine_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\carbine_v1.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\carbine_v1.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 4
BitmapSequenceIndex: Byte = 4 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin -1.8 1
Origin: RealPoint2d = { X: -1.8, Y: 1 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 1.8 -1
Origin: RealPoint2d = { X: 1.8, Y: -1 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin -1.8 -1
Origin: RealPoint2d = { X: -1.8, Y: -1 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Origin 1.8 1
Origin: RealPoint2d = { X: 1.8, Y: 1 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Origin 1 1
Origin: RealPoint2d = { X: 1, Y: 1 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Offset 382.5 154.5
Offset: RealPoint2d = { X: 382.5, Y: 154.5 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Scale -2.1 -2.1
Scale: RealPoint2d = { X: -2.1, Y: -2.1 } 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Offset -468 -162
Offset: RealPoint2d = { X: -468, Y: -162 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v1.chud_definition> 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Origin -3.27 0
Origin: RealPoint2d = { X: -3.27, Y: 0 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v1.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Scale 1.365 1.365
Scale: RealPoint2d = { X: 1.365, Y: 1.365 } 

tags\ui\chud\carbine_v1.chud_definition> savetagchanges
Done!

tags\ui\chud\carbine_v1.chud_definition> exitto tags

tags> 

tags> edittag 0x25CC
Tag ui\chud\carbine_v2.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\carbine_v2.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\carbine_v2.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\carbine_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\carbine_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\carbine_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\carbine_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\carbine_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\carbine_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\carbine_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\carbine_v2.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 4
BitmapSequenceIndex: Byte = 4 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin -1.8 1
Origin: RealPoint2d = { X: -1.8, Y: 1 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 1.8 -1
Origin: RealPoint2d = { X: 1.8, Y: -1 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin -1.8 -1
Origin: RealPoint2d = { X: -1.8, Y: -1 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Origin 1.8 1
Origin: RealPoint2d = { X: 1.8, Y: 1 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Origin 1 1
Origin: RealPoint2d = { X: 1, Y: 1 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Offset 382.5 154.5
Offset: RealPoint2d = { X: 382.5, Y: 154.5 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Scale -2.1 -2.1
Scale: RealPoint2d = { X: -2.1, Y: -2.1 } 

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Offset -468 -162
Offset: RealPoint2d = { X: -468, Y: -162 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v2.chud_definition> 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Origin -3.27 0
Origin: RealPoint2d = { X: -3.27, Y: 0 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v2.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Scale 1.365 1.365
Scale: RealPoint2d = { X: 1.365, Y: 1.365 } 

tags\ui\chud\carbine_v2.chud_definition> savetagchanges
Done!

tags\ui\chud\carbine_v2.chud_definition> exitto tags

tags> 

tags> edittag 0x000025D5
Tag ui\chud\carbine_v3.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\carbine_v3.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\carbine_v3.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\carbine_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\carbine_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\carbine_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\carbine_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\carbine_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\carbine_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\carbine_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\carbine_v3.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 4
BitmapSequenceIndex: Byte = 4 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin -1.8 1
Origin: RealPoint2d = { X: -1.8, Y: 1 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 1.8 -1
Origin: RealPoint2d = { X: 1.8, Y: -1 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin -1.8 -1
Origin: RealPoint2d = { X: -1.8, Y: -1 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Origin 1.8 1
Origin: RealPoint2d = { X: 1.8, Y: 1 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Origin 1 1
Origin: RealPoint2d = { X: 1, Y: 1 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Offset 382.5 154.5
Offset: RealPoint2d = { X: 382.5, Y: 154.5 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Scale -2.1 -2.1
Scale: RealPoint2d = { X: -2.1, Y: -2.1 } 

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Offset -468 -162
Offset: RealPoint2d = { X: -468, Y: -162 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v3.chud_definition> 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Origin -3.27 0
Origin: RealPoint2d = { X: -3.27, Y: 0 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v3.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Scale 1.365 1.365
Scale: RealPoint2d = { X: 1.365, Y: 1.365 } 

tags\ui\chud\carbine_v3.chud_definition> savetagchanges
Done!

tags\ui\chud\carbine_v3.chud_definition> exitto tags

tags> 

tags> edittag 0x000025B1
Tag ui\chud\carbine_v4.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\carbine_v4.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\carbine_v4.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\carbine_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\carbine_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\carbine_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\carbine_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\carbine_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\carbine_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\carbine_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\carbine_v4.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 4
BitmapSequenceIndex: Byte = 4 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin -1.8 1
Origin: RealPoint2d = { X: -1.8, Y: 1 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 1.8 -1
Origin: RealPoint2d = { X: 1.8, Y: -1 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin -1.8 -1
Origin: RealPoint2d = { X: -1.8, Y: -1 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Origin 1.8 1
Origin: RealPoint2d = { X: 1.8, Y: 1 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Origin 1 1
Origin: RealPoint2d = { X: 1, Y: 1 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Offset 382.5 154.5
Offset: RealPoint2d = { X: 382.5, Y: 154.5 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Scale -2.1 -2.1
Scale: RealPoint2d = { X: -2.1, Y: -2.1 } 

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Offset -468 -162
Offset: RealPoint2d = { X: -468, Y: -162 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v4.chud_definition> 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Origin -3.27 0
Origin: RealPoint2d = { X: -3.27, Y: 0 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v4.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Scale 1.365 1.365
Scale: RealPoint2d = { X: 1.365, Y: 1.365 } 

tags\ui\chud\carbine_v4.chud_definition> savetagchanges
Done!

tags\ui\chud\carbine_v4.chud_definition> exitto tags

tags> 

tags> edittag 0x000025C3
Tag ui\chud\carbine_v5.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\carbine_v5.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\carbine_v5.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\carbine_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\carbine_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\carbine_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\carbine_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\carbine_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\carbine_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\carbine_v5.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\carbine_v5.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\carbine_v5.chud_definition> 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 4
BitmapSequenceIndex: Byte = 4 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\carbine_v5.chud_definition> 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v5.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v5.chud_definition> savetagchanges
Done!

tags\ui\chud\carbine_v5.chud_definition> exitto tags

tags> 

tags> edittag 0x000023FE
Tag ui\chud\carbine_v6.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\carbine_v6.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\carbine_v6.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\carbine_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\carbine_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\carbine_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\carbine_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\carbine_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\carbine_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\carbine_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\carbine_v6.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 4
BitmapSequenceIndex: Byte = 4 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin -1.8 1
Origin: RealPoint2d = { X: -1.8, Y: 1 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 1.8 -1
Origin: RealPoint2d = { X: 1.8, Y: -1 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin -1.8 -1
Origin: RealPoint2d = { X: -1.8, Y: -1 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Origin 1.8 1
Origin: RealPoint2d = { X: 1.8, Y: 1 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Origin 1 1
Origin: RealPoint2d = { X: 1, Y: 1 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Offset 382.5 154.5
Offset: RealPoint2d = { X: 382.5, Y: 154.5 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Scale -2.1 -2.1
Scale: RealPoint2d = { X: -2.1, Y: -2.1 } 

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Offset -468 -162
Offset: RealPoint2d = { X: -468, Y: -162 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[6].PlacementData[0].Scale 2.1 2.1
Scale: RealPoint2d = { X: 2.1, Y: 2.1 } 

tags\ui\chud\carbine_v6.chud_definition> 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Origin -3.27 0
Origin: RealPoint2d = { X: -3.27, Y: 0 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\carbine_v6.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[7].PlacementData[0].Scale 1.365 1.365
Scale: RealPoint2d = { X: 1.365, Y: 1.365 } 

tags\ui\chud\carbine_v6.chud_definition> savetagchanges
Done!

tags\ui\chud\carbine_v6.chud_definition> exitto tags

tags> 

tags> ECHO MAULER
MAULER 
tags> edittag 0x0000208E
Tag ui\chud\excavator.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\excavator.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 12
BitmapSequenceIndex: Byte = 12 

tags\ui\chud\excavator.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\excavator.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\excavator.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\excavator.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\excavator.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\excavator.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\excavator.chud_definition> savetagchanges
Done!

tags\ui\chud\excavator.chud_definition> exitto tags

tags> 

tags> edittag 0x00002409
Tag ui\chud\excavator_v6.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\excavator_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 12
BitmapSequenceIndex: Byte = 12 

tags\ui\chud\excavator_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\excavator_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\excavator_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\excavator_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\excavator_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\excavator_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\excavator_v6.chud_definition> savetagchanges
Done!

tags\ui\chud\excavator_v6.chud_definition> exitto tags

tags> 

tags> ECHO FLAMETHROWER
FLAMETHROWER 
tags> edittag 0x000031C5
Tag ui\chud\flamethrower.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\flamethrower.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].BitmapSequenceIndex 18
BitmapSequenceIndex: Byte = 18 

tags\ui\chud\flamethrower.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\flamethrower.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\flamethrower.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\flamethrower.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\flamethrower.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\flamethrower.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\flamethrower.chud_definition> savetagchanges
Done!

tags\ui\chud\flamethrower.chud_definition> exitto tags

tags> 

tags> ECHO FUEL ROD CANNON
FUEL ROD CANNON 
tags> Edittag 0x000021DE
Tag ui\chud\fuel_rod_cannon.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[4].BitmapWidgets[0].BitmapSequenceIndex 19
BitmapSequenceIndex: Byte = 19 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[4].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[4].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[4].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[4].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[4].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> Setfield HUDWidgets[4].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\fuel_rod_cannon.chud_definition> savetagchanges
Done!

tags\ui\chud\fuel_rod_cannon.chud_definition> exitto tags

tags> 

tags> ECHO HAMMER TIME?
HAMMER TIME? 
tags> edittag 0x000031FC
Tag ui\chud\hammer.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\hammer.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].BitmapSequenceIndex 20
BitmapSequenceIndex: Byte = 20 

tags\ui\chud\hammer.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\hammer.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\hammer.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\hammer.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\hammer.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\hammer.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\hammer.chud_definition> savetagchanges
Done!

tags\ui\chud\hammer.chud_definition> exitto tags

tags> 

tags> ECHO BRRRRRRRRRR MACHINE GUN
BRRRRRRRRRR MACHINE GUN 
tags> edittag 0x0000219D
Tag ui\chud\machinegun_turret.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\machinegun_turret.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].BitmapSequenceIndex 13
BitmapSequenceIndex: Byte = 13 

tags\ui\chud\machinegun_turret.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\machinegun_turret.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\machinegun_turret.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\machinegun_turret.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].Bitmap 0x21D4
Bitmap: CachedTag = [0x21D4] ui\chud\bitmaps\hud_vehicle_reticles.bitmap 

tags\ui\chud\machinegun_turret.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\machinegun_turret.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\machinegun_turret.chud_definition> savetagchanges
Done!

tags\ui\chud\machinegun_turret.chud_definition> exit

tags> 

tags> ECHO MAGNUM
MAGNUM 
tags> edittag 0x000020BC
Tag ui\chud\magnum.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\magnum.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 14
BitmapSequenceIndex: Byte = 14 

tags\ui\chud\magnum.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\magnum.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\magnum.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\magnum.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\magnum.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\magnum.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\magnum.chud_definition> savetagchanges
Done!

tags\ui\chud\magnum.chud_definition> exitto tags

tags> 

tags> edittag 0x00002412
Tag ui\chud\magnum_v2.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 14
BitmapSequenceIndex: Byte = 14 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\magnum_v2.chud_definition> 

tags\ui\chud\magnum_v2.chud_definition> 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v2.chud_definition> savetagchanges
Done!

tags\ui\chud\magnum_v2.chud_definition> exitto tags

tags> 

tags> edittag 0x0000241B
Tag ui\chud\magnum_v6.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 14
BitmapSequenceIndex: Byte = 14 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\magnum_v6.chud_definition> 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\magnum_v6.chud_definition> 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[0].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\magnum_v6.chud_definition> 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[1].PlacementData[0].Origin 1.6 0
Origin: RealPoint2d = { X: 1.6, Y: 0 } 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[1].PlacementData[0].Offset 0 10.5
Offset: RealPoint2d = { X: 0, Y: 10.5 } 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[1].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\magnum_v6.chud_definition> 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].PlacementData[0].Origin 0 1.6
Origin: RealPoint2d = { X: 0, Y: 1.6 } 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\magnum_v6.chud_definition> 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].PlacementData[0].Offset -37.5 67.5
Offset: RealPoint2d = { X: -37.5, Y: 67.5 } 

tags\ui\chud\magnum_v6.chud_definition> Setfield HUDWidgets[6].BitmapWidgets[3].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\magnum_v6.chud_definition> savetagchanges
Done!

tags\ui\chud\magnum_v6.chud_definition> exitto tags

tags> 

tags> ECHO MISILE PODS
MISILE PODS 
tags> edittag 0x0000215A
Tag ui\chud\missile.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].BitmapSequenceIndex 15
BitmapSequenceIndex: Byte = 15 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\missile.chud_definition> 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].BitmapSequenceIndex 28
BitmapSequenceIndex: Byte = 28 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\missile.chud_definition> 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].BitmapSequenceIndex 28
BitmapSequenceIndex: Byte = 28 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\missile.chud_definition> 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].BitmapSequenceIndex 15
BitmapSequenceIndex: Byte = 15 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\missile.chud_definition> 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].BitmapSequenceIndex 15
BitmapSequenceIndex: Byte = 15 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\missile.chud_definition> 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].BitmapSequenceIndex 27
BitmapSequenceIndex: Byte = 27 

tags\ui\chud\missile.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\missile.chud_definition> savetagchanges
Done!

tags\ui\chud\missile.chud_definition> exitto tags

tags> 

tags> Echo NEEDLER NOT MUCH LOL
NEEDLER NOT MUCH LOL 
tags> edittag 0x000020ED 
Tag ui\chud\needler.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\needler.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\needler.chud_definition> savetagchanges
Done!

tags\ui\chud\needler.chud_definition> exitto tags

tags> 

tags> ECHO PLASMA PISTOL >_>
PLASMA PISTOL _ 
tags> edittag 0x0000225A
Tag ui\chud\plasma_pistol.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\plasma_pistol.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\plasma_pistol.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].offset 0 -6
Offset: RealPoint2d = { X: 0, Y: -6 } 

tags\ui\chud\plasma_pistol.chud_definition> 

tags\ui\chud\plasma_pistol.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\plasma_pistol.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.8 0.8
Scale: RealPoint2d = { X: 0.8, Y: 0.8 } 

tags\ui\chud\plasma_pistol.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].offset 0 -2
Offset: RealPoint2d = { X: 0, Y: -2 } 

tags\ui\chud\plasma_pistol.chud_definition> Savetagchanges
Done!

tags\ui\chud\plasma_pistol.chud_definition> exitto tags

tags> 

tags> edittag 0x00002423
Tag ui\chud\plasma_pistol_v6.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\plasma_pistol_v6.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\plasma_pistol_v6.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\plasma_pistol_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\plasma_pistol_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\plasma_pistol_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\plasma_pistol_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\plasma_pistol_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\plasma_pistol_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\plasma_pistol_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\plasma_pistol_v6.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\plasma_pistol_v6.chud_definition> 

tags\ui\chud\plasma_pistol_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\plasma_pistol_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].offset 0 -6
Offset: RealPoint2d = { X: 0, Y: -6 } 

tags\ui\chud\plasma_pistol_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\plasma_pistol_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 10
BitmapSequenceIndex: Byte = 10 

tags\ui\chud\plasma_pistol_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\plasma_pistol_v6.chud_definition> 

tags\ui\chud\plasma_pistol_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\plasma_pistol_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\plasma_pistol_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\plasma_pistol_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\plasma_pistol_v6.chud_definition> savetagchanges
Done!

tags\ui\chud\plasma_pistol_v6.chud_definition> exitto tags

tags> 

tags> ECHO PK FIRE, plasma kiffle :)
PK FIRE, plasma kiffle :) 
tags> edittag 0x00001E48
Tag ui\chud\plasma_rifle.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\plasma_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\plasma_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\plasma_rifle.chud_definition> exitto tags

tags> 

tags> edittag 0x000023F3
Tag ui\chud\plasma_rifle_v6.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\plasma_rifle_v6.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\plasma_rifle_v6.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\plasma_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\plasma_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\plasma_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\plasma_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\plasma_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\plasma_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\plasma_rifle_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\plasma_rifle_v6.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\plasma_rifle_v6.chud_definition> 

tags\ui\chud\plasma_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\plasma_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\plasma_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 6
BitmapSequenceIndex: Byte = 6 

tags\ui\chud\plasma_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\plasma_rifle_v6.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\plasma_rifle_v6.chud_definition> savetagchanges
Done!

tags\ui\chud\plasma_rifle_v6.chud_definition> exitto tags

tags> 

tags> ECHO PLASMA TURRET
PLASMA TURRET 
tags> edittag 0x00002527
Tag ui\chud\plasma_turret.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\plasma_turret.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\plasma_turret.chud_definition> savetagchanges
Done!

tags\ui\chud\plasma_turret.chud_definition> exitto tags

tags> 

tags> ECHO ROCKET LAUNCHER
ROCKET LAUNCHER 
tags> edittag 0x00001C9F
Tag ui\chud\rocket.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 7
BitmapSequenceIndex: Byte = 7 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\rocket.chud_definition> 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\rocket.chud_definition> 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 4.5 4.5
Scale: RealPoint2d = { X: 4.5, Y: 4.5 } 

tags\ui\chud\rocket.chud_definition> 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 7.5 7.5
Scale: RealPoint2d = { X: 7.5, Y: 7.5 } 

tags\ui\chud\rocket.chud_definition> 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Offset -198 165
Offset: RealPoint2d = { X: -198, Y: 165 } 

tags\ui\chud\rocket.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\rocket.chud_definition> savetagchanges
Done!

tags\ui\chud\rocket.chud_definition> exitto tags

tags> 

tags> ECHO SENTIENT BEING????? BEAM? BEAN?
SENTIENT BEING????? BEAM? BEAN? 
tags> edittag 0x0000322C
Tag ui\chud\sentinel_beam.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\sentinel_beam.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\sentinel_beam.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\sentinel_beam.chud_definition> savetagchanges
Done!

tags\ui\chud\sentinel_beam.chud_definition> exitto tags

tags> 

tags> ECHO dirtbag shotty
dirtbag shotty 
tags> edittag 0x00001EFE
Tag ui\chud\shotgun.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\shotgun.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\shotgun.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\shotgun.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\shotgun.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 8
BitmapSequenceIndex: Byte = 8 

tags\ui\chud\shotgun.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\shotgun.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\shotgun.chud_definition> savetagchanges
Done!

tags\ui\chud\shotgun.chud_definition> exitto tags

tags> 

tags> Echo SMG
SMG 
tags> edittag 0x00001F50
Tag ui\chud\smg.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\smg.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\smg.chud_definition> savetagchanges
Done!

tags\ui\chud\smg.chud_definition> exitto tags

tags> 

tags> edittag 0x000023E1
Tag ui\chud\smg_v2.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\smg_v2.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\smg_v2.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\smg_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\smg_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\smg_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\smg_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\smg_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\smg_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\smg_v2.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\smg_v2.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\smg_v2.chud_definition> 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 3
BitmapSequenceIndex: Byte = 3 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[7].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v2.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[8].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v2.chud_definition> savetagchanges
Done!

tags\ui\chud\smg_v2.chud_definition> exitto tags

tags> 

tags> edittag 0x000023D7
Tag ui\chud\smg_v3.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\smg_v3.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\smg_v3.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\smg_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\smg_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\smg_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\smg_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\smg_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\smg_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\smg_v3.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\smg_v3.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\smg_v3.chud_definition> 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\smg_v3.chud_definition> 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[1].PlacementData[0].Origin 1.6 0
Origin: RealPoint2d = { X: 1.6, Y: 0 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[1].PlacementData[0].Offset 0 10.5
Offset: RealPoint2d = { X: 0, Y: 10.5 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[1].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\smg_v3.chud_definition> 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Origin 0 1.6
Origin: RealPoint2d = { X: 0, Y: 1.6 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\smg_v3.chud_definition> 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Offset -37.5 67.5
Offset: RealPoint2d = { X: -37.5, Y: 67.5 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\smg_v3.chud_definition> savetagchanges
Done!

tags\ui\chud\smg_v3.chud_definition> 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].PlacementData[0].origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].BitmapSequenceIndex 3
BitmapSequenceIndex: Byte = 3 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[7].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v3.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[8].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v3.chud_definition> savetagchanges
Done!

tags\ui\chud\smg_v3.chud_definition> exitto tags

tags> 

tags> edittag 0x000023CC
Tag ui\chud\smg_v4.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\smg_v4.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\smg_v4.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\smg_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\smg_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\smg_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\smg_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\smg_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\smg_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\smg_v4.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\smg_v4.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\smg_v4.chud_definition> 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 3
BitmapSequenceIndex: Byte = 3 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[7].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v4.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[8].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v4.chud_definition> savetagchanges
Done!

tags\ui\chud\smg_v4.chud_definition> exitto tags

tags> 

tags> edittag 0x23EA
Tag ui\chud\smg_v6.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\smg_v6.chud_definition> editblock HUDWidgets[2]

tags\ui\chud\smg_v6.chud_definition\HUDWidgets[2]> editblock BitmapWidgets[0]

tags\ui\chud\smg_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> editblock AnimationData[0]

tags\ui\chud\smg_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> editblock Active

tags\ui\chud\smg_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> setfield Animation null
Animation: CachedTag = null 

tags\ui\chud\smg_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> savetagchanges
Done!

tags\ui\chud\smg_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]\Active> exit

tags\ui\chud\smg_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]\AnimationData[0]> exit

tags\ui\chud\smg_v6.chud_definition\HUDWidgets[2]\BitmapWidgets[0]> exit

tags\ui\chud\smg_v6.chud_definition\HUDWidgets[2]> exit

tags\ui\chud\smg_v6.chud_definition> 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\smg_v6.chud_definition> 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[1].PlacementData[0].Origin 1.6 0
Origin: RealPoint2d = { X: 1.6, Y: 0 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[1].PlacementData[0].Offset 0 10.5
Offset: RealPoint2d = { X: 0, Y: 10.5 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[1].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\smg_v6.chud_definition> 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Origin 0 1.6
Origin: RealPoint2d = { X: 0, Y: 1.6 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\smg_v6.chud_definition> 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Origin 1 -1
Origin: RealPoint2d = { X: 1, Y: -1 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Offset -37.5 67.5
Offset: RealPoint2d = { X: -37.5, Y: 67.5 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Scale 2.25 2.25
Scale: RealPoint2d = { X: 2.25, Y: 2.25 } 

tags\ui\chud\smg_v6.chud_definition> savetagchanges
Done!

tags\ui\chud\smg_v6.chud_definition> 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].PlacementData[0].origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].BitmapSequenceIndex 3
BitmapSequenceIndex: Byte = 3 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[1].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[2].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[3].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[4].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[5].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[6].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[7].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v6.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[8].Bitmap null
Bitmap: CachedTag = null 

tags\ui\chud\smg_v6.chud_definition> savetagchanges
Done!

tags\ui\chud\smg_v6.chud_definition> exitto tags

tags> 

tags> ECHO NO SCOPE BUT AT WHAT COST?
NO SCOPE BUT AT WHAT COST? 
tags> edittag 0x00001F90
Tag ui\chud\sniper_rifle.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[1].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 9
BitmapSequenceIndex: Byte = 9 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Origin -1 -1
Origin: RealPoint2d = { X: -1, Y: -1 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 2.4 2.4
Scale: RealPoint2d = { X: 2.4, Y: 2.4 } 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[0].PlacementData[0].Origin 1 0
Origin: RealPoint2d = { X: 1, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[0].PlacementData[0].Offset 352.5 270
Offset: RealPoint2d = { X: 352.5, Y: 270 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[0].PlacementData[0].Scale 1.725 1.725
Scale: RealPoint2d = { X: 1.725, Y: 1.725 } 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[1].PlacementData[0].Origin 1 0
Origin: RealPoint2d = { X: 1, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[1].PlacementData[0].Offset 352.5 270
Offset: RealPoint2d = { X: 352.5, Y: 270 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[1].PlacementData[0].Scale 1.725 1.725
Scale: RealPoint2d = { X: 1.725, Y: 1.725 } 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[2].PlacementData[0].Origin -1 0
Origin: RealPoint2d = { X: -1, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[2].PlacementData[0].Offset -352.5 244.5
Offset: RealPoint2d = { X: -352.5, Y: 244.5 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[2].PlacementData[0].Scale 1.725 1.725
Scale: RealPoint2d = { X: 1.725, Y: 1.725 } 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[3].PlacementData[0].Origin -1 0
Origin: RealPoint2d = { X: -1, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[3].PlacementData[0].Offset -288 232.5
Offset: RealPoint2d = { X: -288, Y: 232.5 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[3].PlacementData[0].Scale 1.725 1.725
Scale: RealPoint2d = { X: 1.725, Y: 1.725 } 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[4].PlacementData[0].Origin -1 0
Origin: RealPoint2d = { X: -1, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[4].PlacementData[0].Offset -288 258
Offset: RealPoint2d = { X: -288, Y: 258 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].Textwidgets[4].PlacementData[0].Scale 1.725 1.725
Scale: RealPoint2d = { X: 1.725, Y: 1.725 } 

tags\ui\chud\sniper_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Origin -1.37 0
Origin: RealPoint2d = { X: -1.37, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[1].PlacementData[0].Scale 3.15 3.15
Scale: RealPoint2d = { X: 3.15, Y: 3.15 } 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Offset -9 157.5
Offset: RealPoint2d = { X: -9, Y: 157.5 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[2].PlacementData[0].Scale 1.8 1.8
Scale: RealPoint2d = { X: 1.8, Y: 1.8 } 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Offset -318 105
Offset: RealPoint2d = { X: -318, Y: 105 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[3].PlacementData[0].Scale 1.5 1.5
Scale: RealPoint2d = { X: 1.5, Y: 1.5 } 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Origin 14 0
Origin: RealPoint2d = { X: 14, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Offset 0 0
Offset: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[4].PlacementData[0].Scale 3.5 0.8
Scale: RealPoint2d = { X: 3.5, Y: 0.8 } 

tags\ui\chud\sniper_rifle.chud_definition> 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Origin 0 3
Origin: RealPoint2d = { X: 0, Y: 3 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Offset 0 -142.5
Offset: RealPoint2d = { X: 0, Y: -142.5 } 

tags\ui\chud\sniper_rifle.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[5].PlacementData[0].Scale 1.8 1.8
Scale: RealPoint2d = { X: 1.8, Y: 1.8 } 

tags\ui\chud\sniper_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\sniper_rifle.chud_definition> exitto tags

tags> 

tags> ECHO SPIKER >_>
SPIKER _ 
tags> edittag 0x00002057
Tag ui\chud\spike_rifle.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\spike_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\spike_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].PlacementData[0].origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\spike_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\spike_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].BitmapSequenceIndex 2
BitmapSequenceIndex: Byte = 2 

tags\ui\chud\spike_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\spike_rifle.chud_definition> Setfield HUDWidgets[2].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\spike_rifle.chud_definition> savetagchanges
Done!

tags\ui\chud\spike_rifle.chud_definition> exitto tags

tags> 

tags> ECHO SWORD <_< yea I have no idea what to put as an funny comment lmao
SWORD <_< yea I have no idea what to put as an funny comment lmao 
tags> edittag 0x00002439
Tag ui\chud\sword.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\sword.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].Scale 0.4425 0.4425
Scale: RealPoint2d = { X: 0.4425, Y: 0.4425 } 

tags\ui\chud\sword.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].PlacementData[0].origin 0 0
Origin: RealPoint2d = { X: 0, Y: 0 } 

tags\ui\chud\sword.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].Bitmap 0x00005A90
Bitmap: CachedTag = [0x5A90] ui\chud\bitmaps\hud_reticles_h3.bitmap 

tags\ui\chud\sword.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].BitmapSequenceIndex 13
BitmapSequenceIndex: Byte = 13 

tags\ui\chud\sword.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].flags none
Flags: WidgetBitmapFlags = None 

tags\ui\chud\sword.chud_definition> Setfield HUDWidgets[3].BitmapWidgets[0].RenderData[0].Rangeinput Zero
RangeInput: ChudRenderExternalInputHO = Zero 

tags\ui\chud\sword.chud_definition> savetagchanges
Done!

tags\ui\chud\sword.chud_definition> exitto tags

tags> 

tags> echo uhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh????
uhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh???? 
tags> edittag 0x00002522
Tag ui\chud\t_machinegun.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\t_machinegun.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.2625 0.2625
Scale: RealPoint2d = { X: 0.2625, Y: 0.2625 } 

tags\ui\chud\t_machinegun.chud_definition> savetagchanges
Done!

tags\ui\chud\t_machinegun.chud_definition> exitto tags

tags> 

tags> edittag 0x00003CC9
Tag ui\chud\t_missile.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\t_missile.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.295 0.295
Scale: RealPoint2d = { X: 0.295, Y: 0.295 } 

tags\ui\chud\t_missile.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[1].PlacementData[0].Scale 0.25 0.25
Scale: RealPoint2d = { X: 0.25, Y: 0.25 } 

tags\ui\chud\t_missile.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[2].PlacementData[0].Scale 0.25 0.25
Scale: RealPoint2d = { X: 0.25, Y: 0.25 } 

tags\ui\chud\t_missile.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[3].PlacementData[0].Scale 0.295 0.295
Scale: RealPoint2d = { X: 0.295, Y: 0.295 } 

tags\ui\chud\t_missile.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[4].PlacementData[0].Scale 0.295 0.295
Scale: RealPoint2d = { X: 0.295, Y: 0.295 } 

tags\ui\chud\t_missile.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[5].PlacementData[0].Scale 0.295 0.295
Scale: RealPoint2d = { X: 0.295, Y: 0.295 } 

tags\ui\chud\t_missile.chud_definition> savetagchanges
Done!

tags\ui\chud\t_missile.chud_definition> exitto tags

tags> 

tags> edittag 0x00002556
Tag ui\chud\t_plasmaturret.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\t_plasmaturret.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.2625 0.2625
Scale: RealPoint2d = { X: 0.2625, Y: 0.2625 } 

tags\ui\chud\t_plasmaturret.chud_definition> Setfield HUDWidgets[1].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\t_plasmaturret.chud_definition> savetagchanges
Done!

tags\ui\chud\t_plasmaturret.chud_definition> exitto tags

tags> 

tags> ECHO ----------
---------- 
tags> ECHO |VEHICLES|
|VEHICLES| 
tags> ECHO ----------
---------- 
tags> 

tags> nametag 0x000053B1 ui\chud\v_prowler_gunner
[Index: 0x53B1] ui\chud\v_prowler_gunner.chud_definition

tags> nametag 0x0000541A ui\chud\v_prowler_driver
[Index: 0x541A] ui\chud\v_prowler_driver.chud_definition

tags> savetagnames

tags> 

tags> ECHO BANSHEE
BANSHEE 
tags> Edittag 0x00003676
Tag ui\chud\v_banshee.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_banshee.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_banshee.chud_definition> savetagchanges
Done!

tags\ui\chud\v_banshee.chud_definition> exitto tags

tags> 

tags> ECHO chaingunny????????
chaingunny???????? 
tags> Edittag 0x0000251A
Tag ui\chud\v_chaingun.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_chaingun.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_chaingun.chud_definition> savetagchanges
Done!

tags\ui\chud\v_chaingun.chud_definition> exitto tags

tags> 

tags> ECHO GET IN THE CHOPPER
GET IN THE CHOPPER 
tags> edittag 0x000038BE
Tag ui\chud\v_chopper.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_chopper.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_chopper.chud_definition> savetagchanges
Done!

tags\ui\chud\v_chopper.chud_definition> exitto tags

tags> 

tags> ECHO driver dimensia????
driver dimensia???? 
tags> edittag 0x00003649
Tag ui\chud\v_driver.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_driver.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_driver.chud_definition> savetagchanges
Done!

tags\ui\chud\v_driver.chud_definition> exitto tags

tags> 

tags> Echo gaussturret
gaussturret 
tags> edittag 0x2557
Tag ui\chud\v_gaussturret.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_gaussturret.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_gaussturret.chud_definition> savetagchanges
Done!

tags\ui\chud\v_gaussturret.chud_definition> exitto tags

tags> 

tags> Echo kamen rider ghost bad show dont watch it, watch kamen rider build, or any kamen rider in general instead.
kamen rider ghost bad show dont watch it, watch kamen rider build, or any kamen rider in general instead. 
tags> edittag 0x0000384E
Tag ui\chud\v_ghost.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_ghost.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_ghost.chud_definition> savetagchanges
Done!

tags\ui\chud\v_ghost.chud_definition> exitto tags

tags> 

tags> Echo PROOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOWLER
PROOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOWLER 
tags> edittag 0x000053B1
Tag ui\chud\v_prowler_gunner.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_prowler_gunner.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].bitmap 0x21D4
Bitmap: CachedTag = [0x21D4] ui\chud\bitmaps\hud_vehicle_reticles.bitmap 

tags\ui\chud\v_prowler_gunner.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_prowler_gunner.chud_definition> savetagchanges
Done!

tags\ui\chud\v_prowler_gunner.chud_definition> exitto tags

tags> 

tags> edittag 0x0000541A
Tag ui\chud\v_prowler_driver.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_prowler_driver.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].bitmap 0x21D4
Bitmap: CachedTag = [0x21D4] ui\chud\bitmaps\hud_vehicle_reticles.bitmap 

tags\ui\chud\v_prowler_driver.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].offset 0.3 0.3
Offset: RealPoint2d = { X: 0.3, Y: 0.3 } 

tags\ui\chud\v_prowler_driver.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.3 0.3
Scale: RealPoint2d = { X: 0.3, Y: 0.3 } 

tags\ui\chud\v_prowler_driver.chud_definition> savetagchanges
Done!

tags\ui\chud\v_prowler_driver.chud_definition> exitto tags

tags> 

tags> ECHO HOOOOOOORN, UUH HORNET YES YES
HOOOOOOORN, UUH HORNET YES YES 
tags> edittag 0x00002CA3
Tag ui\chud\v_hornet.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_hornet.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_hornet.chud_definition> savetagchanges
Done!

tags\ui\chud\v_hornet.chud_definition> exitto tags

tags> 

tags> echo on top of the word, trying to be invincible mongoose
on top of the word, trying to be invincible mongoose 
tags> edittag 0x00003101
Tag ui\chud\v_mongoose.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_mongoose.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].offset 0 -60
Offset: RealPoint2d = { X: 0, Y: -60 } 

tags\ui\chud\v_mongoose.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_mongoose.chud_definition> savetagchanges
Done!

tags\ui\chud\v_mongoose.chud_definition> exitto tags

tags> 

tags> echo WE HAVE AN TANK
WE HAVE AN TANK 
tags> edittag 0x000028E0
Tag ui\chud\v_scorpion.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_scorpion.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_scorpion.chud_definition> savetagchanges
Done!

tags\ui\chud\v_scorpion.chud_definition> exitto tags

tags> 

tags> edittag 0x00002930
Tag ui\chud\v_scorpionturret.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_scorpionturret.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_scorpionturret.chud_definition> savetagchanges
Done!

tags\ui\chud\v_scorpionturret.chud_definition> exitto tags

tags> 

tags> echo Shady turret
Shady turret 
tags> edittag 0x000030A9
Tag ui\chud\v_shade.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_shade.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_shade.chud_definition> savetagchanges
Done!

tags\ui\chud\v_shade.chud_definition> exitto tags

tags> 

tags> echo wraith (the last one :"))
wraith (the last one :)) 
tags> edittag 0x00003759
Tag ui\chud\v_wraith.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_wraith.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].offset 0 19.5
Offset: RealPoint2d = { X: 0, Y: 19.5 } 

tags\ui\chud\v_wraith.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_wraith.chud_definition> savetagchanges
Done!

tags\ui\chud\v_wraith.chud_definition> exitto tags

tags> 

tags> edittag 0x00003798
Tag ui\chud\v_wraithturret.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_wraithturret.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_wraithturret.chud_definition> savetagchanges
Done!

tags\ui\chud\v_wraithturret.chud_definition> exitto tags

tags> 

tags> edittag 0x000037AF
Tag ui\chud\v_wraith_anti_air.chud_definition has been opened for editing.
New commands are now available. Enter "help" to view them.
Use "exit" to return to tags.

tags\ui\chud\v_wraith_anti_air.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].offset 0 19.5
Offset: RealPoint2d = { X: 0, Y: 19.5 } 

tags\ui\chud\v_wraith_anti_air.chud_definition> Setfield HUDWidgets[0].BitmapWidgets[0].PlacementData[0].Scale 0.375 0.375
Scale: RealPoint2d = { X: 0.375, Y: 0.375 } 

tags\ui\chud\v_wraith_anti_air.chud_definition> savetagchanges
Done!

tags\ui\chud\v_wraith_anti_air.chud_definition> exitto tags

tags> 

tags> dumplog
