Tag Tool [1.5.6355.26459]

Please report any bugs and/or feature requests at
<https://gitlab.com/TheGuardians/TagTool/issues>.

Enter "help" to list available commands. Enter "exit" to quit.

tags> edittag 0x00000F7F
ERROR: Method not found: 'BlamCore.Cache.TagDeserializer BlamCore.Cache.GameCacheContext.get_Deserializer()'.

tags> importbitmap 0 DDS/BR2.dds
Unrecognized command: importbitmap
Use "help" to list available commands.

tags> savetagchanges
Unrecognized command: savetagchanges
Use "help" to list available commands.

tags> exitto tags
Unrecognized command: exitto
Use "help" to list available commands.

tags> 

tags> echo DAMAGE
DAMAGE 
tags> edittag 0x00000FCE
ERROR: Method not found: 'BlamCore.Cache.TagDeserializer BlamCore.Cache.GameCacheContext.get_Deserializer()'.

tags> importbitmap 0 DDS/BR2.dds
Unrecognized command: importbitmap
Use "help" to list available commands.

tags> savetagchanges
Unrecognized command: savetagchanges
Use "help" to list available commands.

tags> exitto tags
Unrecognized command: exitto
Use "help" to list available commands.

tags> 

tags> echo AMMO
AMMO 
tags> edittag 0x00000FC1
ERROR: Method not found: 'BlamCore.Cache.TagDeserializer BlamCore.Cache.GameCacheContext.get_Deserializer()'.

tags> importbitmap 0 DDS/00000FC1.dds
Unrecognized command: importbitmap
Use "help" to list available commands.

tags> savetagchanges
Unrecognized command: savetagchanges
Use "help" to list available commands.

tags> exitto tags
Unrecognized command: exitto
Use "help" to list available commands.

tags> 

tags> echo ACCURACY AND RANGE
ACCURACY AND RANGE 
tags> edittag 0x00000FA4
ERROR: Method not found: 'BlamCore.Cache.TagDeserializer BlamCore.Cache.GameCacheContext.get_Deserializer()'.

tags> importbitmap 0 DDS/BRSCOPE.dds
Unrecognized command: importbitmap
Use "help" to list available commands.

tags> savetagchanges
Unrecognized command: savetagchanges
Use "help" to list available commands.

tags> exitto tags
Unrecognized command: exitto
Use "help" to list available commands.

tags> 

tags> echo POWER
POWER 
tags> edittag 0x00000FD5
ERROR: Method not found: 'BlamCore.Cache.TagDeserializer BlamCore.Cache.GameCacheContext.get_Deserializer()'.

tags> importbitmap 0 DDS/00000FD5.dds
Unrecognized command: importbitmap
Use "help" to list available commands.

tags> savetagchanges
Unrecognized command: savetagchanges
Use "help" to list available commands.

tags> exitto tags
Unrecognized command: exitto
Use "help" to list available commands.

tags> 

tags> echo DAMAGE
DAMAGE 
tags> edittag 0x00000FCE
ERROR: Method not found: 'BlamCore.Cache.TagDeserializer BlamCore.Cache.GameCacheContext.get_Deserializer()'.
